In [3]:
import pandas
df = pandas.read_csv('full.csv')
df_schema = pandas.read_csv('schema.csv')

In [4]:
df

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
0,1964,FEB,24,23,30,25.0,38.9000,23.9000,10,5.3
1,1964,APR,11,16,0,0.0,39.7500,25.2500,10,5.7
2,1964,APR,21,8,14,40.0,38.5000,22.2500,10,4.5
3,1964,APR,24,3,49,58.0,38.0000,21.8000,10,5.0
4,1964,APR,29,4,21,0.0,39.2500,23.7500,10,5.8
...,...,...,...,...,...,...,...,...,...,...
313395,2021,APR,9,5,0,7.4,39.7856,21.9081,5,0.6
313396,2021,APR,9,5,0,21.9,39.7920,21.9328,5,1.5
313397,2021,APR,9,5,1,6.5,39.7160,22.1947,8,1.0
313398,2021,APR,9,5,2,5.6,39.7929,21.9154,6,1.0
313399,2021,APR,9,5,15,5.0,39.8007,21.8948,7,1.2

In [5]:
df_schema

      COLUMN                   ATTRIBUTE
0       YEAR       event Date: Year XXXX
1      MONTH      event Date: Month abbr
2        DAY             event Date: Day
3       HOUR  event Time (GMT): Hour 24h
4     MINUTE    event Time (GMT): Minute
5     SECOND    event Time (GMT): Second
6   LATITUDE          event Latitude (N)
7  LONGITUDE         event Longitude (E)
8      DEPTH            event Depth (km)
9  MAGNITUDE          event Magnitude Mr

In [6]:
df['MAGNITUDE']

0         5.3
1         5.7
2         4.5
3         5.0
4         5.8
         ...
313395    0.6
313396    1.5
313397    1.0
313398    1.0
313399    1.2
Name: MAGNITUDE, Length: 313400, dtype: float64

set the magnitude as the indices of these events (that will not work here, try it anyway)

In [7]:
df.set_index('MAGNITUDE')

           YEAR MONTH  DAY  HOUR  MINUTE  SECOND  LATITUDE  LONGITUDE  DEPTH
MAGNITUDE
5.3        1964   FEB   24    23      30    25.0   38.9000    23.9000     10
5.7        1964   APR   11    16       0     0.0   39.7500    25.2500     10
4.5        1964   APR   21     8      14    40.0   38.5000    22.2500     10
5.0        1964   APR   24     3      49    58.0   38.0000    21.8000     10
5.8        1964   APR   29     4      21     0.0   39.2500    23.7500     10
...         ...   ...  ...   ...     ...     ...       ...        ...    ...
0.6        2021   APR    9     5       0     7.4   39.7856    21.9081      5
1.5        2021   APR    9     5       0    21.9   39.7920    21.9328      5
1.0        2021   APR    9     5       1     6.5   39.7160    22.1947      8
1.0        2021   APR    9     5       2     5.6   39.7929    21.9154      6
1.2        2021   APR    9     5      15     5.0   39.8007    21.8948      7

[313400 rows x 9 columns]

wow, actually it did work

In [8]:
df

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
0,1964,FEB,24,23,30,25.0,38.9000,23.9000,10,5.3
1,1964,APR,11,16,0,0.0,39.7500,25.2500,10,5.7
2,1964,APR,21,8,14,40.0,38.5000,22.2500,10,4.5
3,1964,APR,24,3,49,58.0,38.0000,21.8000,10,5.0
4,1964,APR,29,4,21,0.0,39.2500,23.7500,10,5.8
...,...,...,...,...,...,...,...,...,...,...
313395,2021,APR,9,5,0,7.4,39.7856,21.9081,5,0.6
313396,2021,APR,9,5,0,21.9,39.7920,21.9328,5,1.5
313397,2021,APR,9,5,1,6.5,39.7160,22.1947,8,1.0
313398,2021,APR,9,5,2,5.6,39.7929,21.9154,6,1.0
313399,2021,APR,9,5,15,5.0,39.8007,21.8948,7,1.2

dataframe didn't actually change, pandas do not make changes in place
now if we make it permanent:Â§

In [9]:
df.set_index('MAGNITUDE', inplace=True)
df

           YEAR MONTH  DAY  HOUR  MINUTE  SECOND  LATITUDE  LONGITUDE  DEPTH
MAGNITUDE
5.3        1964   FEB   24    23      30    25.0   38.9000    23.9000     10
5.7        1964   APR   11    16       0     0.0   39.7500    25.2500     10
4.5        1964   APR   21     8      14    40.0   38.5000    22.2500     10
5.0        1964   APR   24     3      49    58.0   38.0000    21.8000     10
5.8        1964   APR   29     4      21     0.0   39.2500    23.7500     10
...         ...   ...  ...   ...     ...     ...       ...        ...    ...
0.6        2021   APR    9     5       0     7.4   39.7856    21.9081      5
1.5        2021   APR    9     5       0    21.9   39.7920    21.9328      5
1.0        2021   APR    9     5       1     6.5   39.7160    22.1947      8
1.0        2021   APR    9     5       2     5.6   39.7929    21.9154      6
1.2        2021   APR    9     5      15     5.0   39.8007    21.8948      7

[313400 rows x 9 columns]

In [10]:
df.index

Float64Index([5.3, 5.7, 4.5, 5.0, 5.8, 5.2, 4.9, 4.2, 4.4, 5.8,
              ...
              0.2, 3.0, 0.2, 1.1, 3.0, 0.6, 1.5, 1.0, 1.0, 1.2],
             dtype='float64', name='MAGNITUDE', length=313400)

now we can find a specific row by passing magnitude, check this

In [13]:
df.loc[6.0] # all the quakes of magnitude 6, as now we changed the index

           YEAR MONTH  DAY  HOUR  MINUTE  SECOND  LATITUDE  LONGITUDE  DEPTH
MAGNITUDE
6.0        1966   SEP    1    14      22    57.0   37.5000    22.3000     10
6.0        1966   OCT   29     2      39    25.8   38.8000    21.0000     10
6.0        1969   JAN   14    23      12     9.0   36.2000    28.9000     10
6.0        1978   JUN   20    20       3    21.0   40.8000    23.3000     33
6.0        1980   JUL    9     2      11    54.0   39.2000    23.9000     10
6.0        1981   DEC   27    17      39    12.0   38.9000    24.9000     10
6.0        2004   MAR   17     5      20    58.2   34.4600    23.2600     24
6.0        2008   FEB   20    18      27     4.9   36.1800    21.7200     25
6.0        2015   NOV   17     7      10     7.3   38.6700    20.6000     11
6.0        2020   MAY    2    12      51     9.2   34.4366    25.6915      9
6.0        2021   MAR    3    10      16     8.3   39.7591    22.2102      8

how to reset index?

In [14]:
df.reset_index(inplace=True)

In [15]:
df

,MAGNITUDE,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH
0,5.3,1964,FEB,24,23,30,25.0,38.9000,23.9000,10
1,5.7,1964,APR,11,16,0,0.0,39.7500,25.2500,10
2,4.5,1964,APR,21,8,14,40.0,38.5000,22.2500,10
3,5.0,1964,APR,24,3,49,58.0,38.0000,21.8000,10
4,5.8,1964,APR,29,4,21,0.0,39.2500,23.7500,10
...,...,...,...,...,...,...,...,...,...,...
313395,0.6,2021,APR,9,5,0,7.4,39.7856,21.9081,5
313396,1.5,2021,APR,9,5,0,21.9,39.7920,21.9328,5
313397,1.0,2021,APR,9,5,1,6.5,39.7160,22.1947,8
313398,1.0,2021,APR,9,5,2,5.6,39.7929,21.9154,6
313399,1.2,2021,APR,9,5,15,5.0,39.8007,21.8948,7

if you know at first, we can do it as we load from csv, for example:

In [16]:
df_full_by_magnitude = pandas.read_csv('full.csv', index_col='MAGNITUDE')

In [17]:
df_full_by_magnitude

           YEAR MONTH  DAY  HOUR  MINUTE  SECOND  LATITUDE  LONGITUDE  DEPTH
MAGNITUDE
5.3        1964   FEB   24    23      30    25.0   38.9000    23.9000     10
5.7        1964   APR   11    16       0     0.0   39.7500    25.2500     10
4.5        1964   APR   21     8      14    40.0   38.5000    22.2500     10
5.0        1964   APR   24     3      49    58.0   38.0000    21.8000     10
5.8        1964   APR   29     4      21     0.0   39.2500    23.7500     10
...         ...   ...  ...   ...     ...     ...       ...        ...    ...
0.6        2021   APR    9     5       0     7.4   39.7856    21.9081      5
1.5        2021   APR    9     5       0    21.9   39.7920    21.9328      5
1.0        2021   APR    9     5       1     6.5   39.7160    22.1947      8
1.0        2021   APR    9     5       2     5.6   39.7929    21.9154      6
1.2        2021   APR    9     5      15     5.0   39.8007    21.8948      7

[313400 rows x 9 columns]

In [18]:
df_full_by_magnitude.reset_index()

,MAGNITUDE,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH
0,5.3,1964,FEB,24,23,30,25.0,38.9000,23.9000,10
1,5.7,1964,APR,11,16,0,0.0,39.7500,25.2500,10
2,4.5,1964,APR,21,8,14,40.0,38.5000,22.2500,10
3,5.0,1964,APR,24,3,49,58.0,38.0000,21.8000,10
4,5.8,1964,APR,29,4,21,0.0,39.2500,23.7500,10
...,...,...,...,...,...,...,...,...,...,...
313395,0.6,2021,APR,9,5,0,7.4,39.7856,21.9081,5
313396,1.5,2021,APR,9,5,0,21.9,39.7920,21.9328,5
313397,1.0,2021,APR,9,5,1,6.5,39.7160,22.1947,8
313398,1.0,2021,APR,9,5,2,5.6,39.7929,21.9154,6
313399,1.2,2021,APR,9,5,15,5.0,39.8007,21.8948,7

In [21]:
df_schema = pandas.read_csv('schema.csv', index_col="COLUMN")

In [22]:
df_schema

                            ATTRIBUTE
COLUMN
YEAR            event Date: Year XXXX
MONTH          event Date: Month abbr
DAY                   event Date: Day
HOUR       event Time (GMT): Hour 24h
MINUTE       event Time (GMT): Minute
SECOND       event Time (GMT): Second
LATITUDE           event Latitude (N)
LONGITUDE         event Longitude (E)
DEPTH                event Depth (km)
MAGNITUDE          event Magnitude Mr

In [31]:
df_schema.loc['YEAR', 'ATTRIBUTE']

'event Date: Year XXXX'

how to sort by index

In [37]:
df_full_by_magnitude.sort_index()

           YEAR MONTH  DAY  HOUR  MINUTE  SECOND  LATITUDE  LONGITUDE  DEPTH
MAGNITUDE
0.0        2010   SEP   29     2       9    47.2   37.8600    23.0900     93
0.0        2015   JUL   25     1      26    10.6   38.3800    21.9400     10
0.1        2021   JAN   21     6       1    50.6   38.3748    22.0290      6
0.1        2013   DEC   16     1      35    32.3   38.3500    22.1400     10
0.1        2020   JUL   30     0      33    13.3   38.4023    21.9987      7
...         ...   ...  ...   ...     ...     ...       ...        ...    ...
6.6        2018   OCT   25    22      54    50.5   37.3516    20.4922     13
6.7        2020   OCT   30    11      51    24.4   37.9001    26.8167     12
6.7        1968   FEB   19    22      45    39.0   39.5000    24.8000     10
6.8        1979   APR   15     6      19    42.0   42.0000    19.0000     10
7.0        1964   OCT    6    14      31    22.0   39.7500    28.0000     10

[313400 rows x 9 columns]

keep the sorting

In [38]:
df_full_by_magnitude.sort_index(inplace=True)

In [39]:
df_full_by_magnitude

           YEAR MONTH  DAY  HOUR  MINUTE  SECOND  LATITUDE  LONGITUDE  DEPTH
MAGNITUDE
0.0        2010   SEP   29     2       9    47.2   37.8600    23.0900     93
0.0        2015   JUL   25     1      26    10.6   38.3800    21.9400     10
0.1        2021   JAN   21     6       1    50.6   38.3748    22.0290      6
0.1        2013   DEC   16     1      35    32.3   38.3500    22.1400     10
0.1        2020   JUL   30     0      33    13.3   38.4023    21.9987      7
...         ...   ...  ...   ...     ...     ...       ...        ...    ...
6.6        2018   OCT   25    22      54    50.5   37.3516    20.4922     13
6.7        2020   OCT   30    11      51    24.4   37.9001    26.8167     12
6.7        1968   FEB   19    22      45    39.0   39.5000    24.8000     10
6.8        1979   APR   15     6      19    42.0   42.0000    19.0000     10
7.0        1964   OCT    6    14      31    22.0   39.7500    28.0000     10

[313400 rows x 9 columns]